# Jeff Widman's Brewfile
# Install via Homebrew:
#   `brew bundle --file=~/.dotfiles/homebrew/.Brewfile`

# Generally life is simplest to not update macOS default SSH
# Because making a non-Apple SSH work with the macOS Keychain can be a pain
# brew 'ssh'


# Install all the things:
brew 'zsh'
brew 'ssh-copy-id'
brew 'git'
brew 'less'
brew 'lesspipe' # pre-processes various file formats so they can be paged via Less
brew 'ctags'
brew 'stow'
brew 'tmux'
brew 'htop'
brew 'iftop'
brew 'ag' # Faster grep
brew 'ncdu' # ncurses-based directory/file size viewer
brew 'tree'

# Kubernetes
brew 'k9s'

# Databases
brew 'sqlite'

# Go
brew 'go'
brew 'golangci-lint'

# Python
brew 'python'

# Ruby
# Use [RVM](http://rvm.io/) instead of Homebrew.

# # Java
# # VisualVM is an alternative to Jconsole for JMX debugging
# brew cask install java  # required for visualvm
# brew cask install visualvm

# Node
# Use [`nvm`](https://github.com/creationix/nvm) instead of Homebrew.
# Install manually using git clone rather than the install script:
# https://github.com/creationix/nvm#manual-install

# Neovim
# I prefer over Vim for the simple reason they accepted one of my patches ;)
brew 'neovim'

# Other linters
brew 'shellcheck'
brew 'yamllint'


# Quicklook plugins
# See https://github.com/sindresorhus/quick-look-plugins
brew 'qlstephen'
brew 'apparency'
# Use `syntax-highlight` instead of qlcolorcode and quicklook-json
# Note: Follow the install instructions on their website for authorizing with MacOS security
brew 'syntax-highlight'
# for betterzipql, install it manually as we don't want the full-blown betterzip app
# https://github.com/sindresorhus/quick-look-plugins#betterzipql
